app/controllers/sessions_controller.rb

  def create

    if((User.find_by user_id: params[:user]["user_id"]) ==nil)
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "taparker"]]