app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "f"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "a"], ["email", "tyler-parker@uiowa.edu"], ["session_token", "3f8V2y/HW4jY49TpfIXUiQ=="], ["created_at", "2015-10-07 20:35:32.561861"], ["updated_at", "2015-10-07 20:35:32.561861"]]
---
  def create

        if((User.find_by user_id: params[:user]["user_id"]) !=nil)
          flash[:notice] = "Sorry, this user-id is taken. Try again."
          redirect_to new_user_path
        else
          User.create_user! (params)